Revit 2027 API
ThermalProperties.Roughness Property
 Value of roughness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Roughness { get; set; }
Public Property Roughness As Integer
	Get
	Set
public:
property int Roughness {
	int get ();
	void set (int value);
}
member Roughness : int with get, set
Property Value
Int32
See Also
Reference
ThermalProperties Class
Autodesk.Revit.DB Namespace